[
    {
        "id": "typescript",
        "displayName": "TypeScript",
        "description": "TypeScript is an open-source programming language developed and maintained by Microsoft. It is a strict syntactical superset of JavaScript, and adds optional static typing to the language."
    },
    {
        "id": "nodejs",
        "displayName": "Node.js",
        "description": "Node.js is an open-source, cross-platform JavaScript run-time environment that executes JavaScript code outside of a browser."
    },
    {
        "id": "csharp",
        "displayName": "C#",
        "description": "C# is a general-purpose, multi-paradigm programming language encompassing strong typing, imperative, declarative, functional, generic, object-oriented, and component-oriented programming disciplines."
    },
    {
        "id": "azure",
        "displayName": "Azure",
        "description": "Microsoft Azure is a cloud computing service created by Microsoft for building, testing, deploying, and managing applications and services through a global network of Microsoft-managed data centers."
    },
    {
        "id": "aws",
        "displayName": "AWS",
        "description": "Amazon Web Services provides on-demand cloud computing platforms to individuals, companies and governments, on a paid subscription basis. The technology allows subscribers to have at their disposal a virtual cluster of computers, available all the time, through the Internet."
    },
    {
        "id": "kubernetes",
        "displayName": "Kubernetes",
        "description": "Kubernetes is an open-source container-orchestration system for automating deployment, scaling and management of containerized applications. It was originally designed by Google and is now maintained by the Cloud Native Computing Foundation."
    },
    {
        "id": "php",
        "displayName": "PHP",
        "description": "PHP is a server-side scripting language designed for Web development, but also used as a general-purpose programming language. It was originally created by Rasmus Lerdorf in 1994."
    },
    {
        "id": "python",
        "displayName": "Python",
        "description": "Python is an interpreted high-level programming language for general-purpose programming. Created by Guido van Rossum and first released in 1991, Python has a design philosophy that emphasizes code readability, notably using significant whitespace."
    },
    {
        "id": "ruby",
        "displayName": "Ruby",
        "description": "Ruby is a dynamic, interpreted, reflective, object-oriented, general-purpose programming language. It was designed and developed in the mid-1990s by Yukihiro Matsumoto in Japan."
    },
    {
        "id": "java",
        "displayName": "Java",
        "description": "Java is a general-purpose computer-programming language that is concurrent, class-based, object-oriented, and specifically designed to have as few implementation dependencies as possible."
    },
    {
        "id": "go",
        "displayName": "Go",
        "description": "Go is a programming language designed by Google engineers Robert Griesemer, Rob Pike, and Ken Thompson. Go is a statically typed, compiled language in the tradition of C, with the added benefits of memory safety, garbage collection, structural typing, and CSP-style concurrency."
    }
]
