[
    {
        "id": "typescript",
        "isDiscipline": false,
        "isVisible": true,
        "displayName": "TypeScript",
        "description": "TypeScript is an open-source programming language developed and maintained by Microsoft. It is a strict syntactical superset of JavaScript, and adds optional static typing to the language."
    },
    {
        "id": "laravel",
        "isDiscipline": false,
        "isVisible": true,
        "displayName": "Laravel",
        "description": "Laravel is a free, open-source PHP web framework, created by Taylor Otwell and intended for the development of web applications following the model–view–controller (MVC) architectural pattern and based on Symfony."
    },
    {
        "id": "javascript",
        "isDiscipline": false,
        "isVisible": false,
        "displayName": "JavaScript",
        "description": "JavaScript is a scripting language created by Brendan Eich in Netscape Communications Corporation. It let's you introduce complex features to the website like animations, save user info, set timers,etc."
    },
    {
        "id": "nodejs",
        "isDiscipline": false,
        "isVisible": false,
        "displayName": "Node.js",
        "description": "Node.js is an open-source, cross-platform JavaScript run-time environment that executes JavaScript code outside of a browser."
    },
    {
        "id": "csharp",
        "isDiscipline": false,
        "isVisible": false,
        "displayName": "C#",
        "description": "C# is a general-purpose, multi-paradigm programming language encompassing strong typing, imperative, declarative, functional, generic, object-oriented, and component-oriented programming disciplines."
    },
    {
        "id": "azure",
        "isDiscipline": false,
        "isVisible": false,
        "displayName": "Azure",
        "description": "Microsoft Azure is a cloud computing service created by Microsoft for building, testing, deploying, and managing applications and services through a global network of Microsoft-managed data centers."
    },
    {
        "id": "aws",
        "isDiscipline": false,
        "isVisible": false,
        "displayName": "AWS",
        "description": "Amazon Web Services provides on-demand cloud computing platforms to individuals, companies and governments, on a paid subscription basis. The technology allows subscribers to have at their disposal a virtual cluster of computers, available all the time, through the Internet."
    },
    {
        "id": "kubernetes",
        "isDiscipline": false,
        "isVisible": false,
        "displayName": "Kubernetes",
        "description": "Kubernetes is an open-source container-orchestration system for automating deployment, scaling and management of containerized applications. It was originally designed by Google and is now maintained by the Cloud Native Computing Foundation."
    },
    {
        "id": "php",
        "isDiscipline": false,
        "isVisible": false,
        "displayName": "PHP",
        "description": "PHP is a server-side scripting language designed for Web development, but also used as a general-purpose programming language. It was originally created by Rasmus Lerdorf in 1994."
    },
    {
        "id": "python",
        "isDiscipline": false,
        "isVisible": false,
        "displayName": "Python",
        "description": "Python is an interpreted high-level programming language for general-purpose programming. Created by Guido van Rossum and first released in 1991, Python has a design philosophy that emphasizes code readability, notably using significant whitespace."
    },
    {
        "id": "ruby",
        "isDiscipline": false,
        "isVisible": false,
        "displayName": "Ruby",
        "description": "Ruby is a dynamic, interpreted, reflective, object-oriented, general-purpose programming language. It was designed and developed in the mid-1990s by Yukihiro Matsumoto in Japan."
    },
    {
        "id": "java",
        "isDiscipline": false,
        "isVisible": false,
        "displayName": "Java",
        "description": "Java is a general-purpose computer-programming language that is concurrent, class-based, object-oriented, and specifically designed to have as few implementation dependencies as possible."
    },
    {
        "id": "go",
        "isDiscipline": false,
        "isVisible": false,
        "displayName": "Go",
        "description": "Go is a programming language designed by Google engineers Robert Griesemer, Rob Pike, and Ken Thompson. Go is a statically typed, compiled language in the tradition of C, with the added benefits of memory safety, garbage collection, structural typing, and CSP-style concurrency."
    },
    {
        "id": "react",
        "isDiscipline": false,
        "isVisible": false,
        "displayName": "React",
        "description": "React is a JavaScript library for building user interfaces. It is maintained by Facebook and a community of individual developers and companies. React can be used as a base in the development of single-page or mobile applications."
    },
    {
        "id": "angular",
        "isDiscipline": false,
        "isVisible": false,
        "displayName": "Angular",
        "description": "Angular is a TypeScript-based open-source front-end web application platform led by the Angular Team at Google and by a community of individuals and corporations. Angular is a complete rewrite from the same team that built AngularJS."
    },
    {
        "id": "devops",
        "isDiscipline": false,
        "isVisible": true,
        "displayName": "Devops",
        "description": "DevOps is a software development methodology that combines software development with information technology operations."
    },
    {
        "id": "functional_programming",
        "isDiscipline": false,
        "isVisible": true,
        "displayName": "Functional Programming",
        "description": "functional programming is a programming paradigm that treats computation as the evaluation of mathematical functions and avoids changing-state and mutable data."
    }
]
